[{"body":"\tThis is my first ever blog. I am writing this blog after reading a post on <a href=\"https://dev.to\" target=\"_blank\">Dev.to</a> which listed the various benefits of writing blogs. So, instead of writing i got down to <i>making</i> a blog and what is a better first blog than the making of the blog itself, hence the title: <b>Blog about this blog</b>\r\n\r\n<br>\r\n\r\nOkay, so it was 1 am in night, 19th April 2020 my birthday , but due to corona virus outbreak couldn't celebrate so was browsing posts on dev.to. Seeing people write blogs kind of inspired me when i found a blog about why to write blogs and that's where it began. 2 a.m. at night i had the idea of making a blog app from scratch, with something i have never used(frontend, i suck at designing 😅). So i picked up materialize and started reading the docs. one hour later i have a static website with first page which if fully responsive and will list all the blogs.\r\n\r\n<br>\r\n<h4>Selecting tech stack</h4>\r\n<ul>\r\n<li> 1.)<a href=\"https://materializecss.com/\" target=\"_blank\">Materialize</a></li>\r\n<li> 2.)<a href=\"https://nodejs.org/en/\" target=\"_blank\">Node.js</a></li>\r\n<li> 3.)<a href=\"https://expressjs.com/\" target=\"_blank\">express</a></li>\r\n\r\n</ul>\r\n<br>\r\nThere is not a particular reason i went with materialize, it just feels minimalistic and smoother than other frameworks out there like Bootstrap.\r\nNodejs and express are something that i recently learnt and am trying to master, i am working on one more project using node and express and my experience is pretty good so far.\r\nLet's Begin\r\nSo the first thing i needed was some cool looking UI, materialize was pretty easy and straightforward in getting this done. I used grid layout with 0-12-0 columns on small and 2-8-2 on medium and above devices.\r\nFor now the 8 column is the main holder of the blog list and for the 2 columns in left and right i have something in mind. \r\n\r\n<pre class=\"line-numbers\">\r\n<code class=\"language-markup\">&lt;div class=\"row\">\r\n   &lt;div class=\"col s0 m2\">&lt;/div>\r\n   &lt;div class=\"col s12 m8\">&lt;/div>\r\n   &lt;div class=\"col s0 m2\">&lt;/div>\r\n&lt;/div>\r\n</code>\r\n</pre>\r\n","title":"Blog about this blog","_id":1,"createdAt":"2020-04-20","editedAt":"2020-04-20","blogSummary":"Idea of this Blog."}]